---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetalPatternType
source: html/1e3be6a2-dc4f-4fb0-29bf-5c4924ca664d.htm
---
# Autodesk.Revit.DB.Visual.MetalPatternType

The enumerated type representing the permitted values for the asset property "MetalPattern" from the "Metal" schema.

## Syntax (C#)
```csharp
public enum MetalPatternType
```